clear all

dt=0.001;
t0=0;
tkinc=0.5;
U0=4; % [Вольт]- амплітуда опорного сигналу
Uinf=2; % [Вольт]- амплітуда інформаційного сигналу
beta=1; % [безрозмірна] - коефіцієнт частотної модуляції
F1inf=5;% частота інформаційного сигналу
fi1=0; %45; % [grad] - фаза інформаційного сигналу
F2op=10^2;% частота опорного сигналу
fi0=0; %10; % [grad] - фаза опорного сигналу

%Розрахунок
t=t0:dt:tkinc; %[c] - час передачі модульованого сигналу (частота опорного сигналу)
omega1=F1inf*2*pi; % [Герц] - частота інформаційного сигналу ; 
omega0=F2op*2*pi;% [Герц] - частота опорного сигналу
rad=pi/180;
St=U0*cos(omega0*t+fi0*rad); % опорний сигнал 
U1=Uinf*cos(omega1*t+fi1*rad); % інформаційний сигнал 
ModSignal=U0*cos(omega0*t+beta*omega0/omega1*sin(omega1*t+fi1*rad)); %модульований сигнал
Fs = 1/dt; %10000; % частота дискретизації
 T = 1/Fs;             % період дискретизації
 L = Fs*tkinc+1;  %100001;   % довжина сигналу
 t = (0:L-1)*T;        % часовий вектор
 Y = fft(ModSignal); % швидке перетворення Фурʼє сигналу
 P2 = abs(Y/L);
P1 = P2(1:(L/2)+1);
P1(2:end-1) = 2*P1(2:end-1);
f = Fs*(0:(L/2))/L;

figure(1)
plot(f,P1)
title('Спектральний склад ЧМ сигналу')
xlabel('f (Hz)')
ylabel('|P1(f)|')
hold on 
plot(t,U1,'r')

figure(2)
plot(t,St)
title('Опорнийсигнал')
xlabel('час')
ylabel('амплітуда')
grid 
hold on 
plot(t,U1,'r')

figure(3)
plot(t,U1)
title('Інформаційнийсигнал')
xlabel('час')
ylabel('амплітуда')
grid

figure(4)
plot(t,ModSignal)
title('Модульованийсигнал')
xlabel('час')
ylabel('амплітуда')
grid
